Revit 2024 API
ModelCurveArrArrayIterator Class
An iterator to a array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public abstract class ModelCurveArrArrayIterator : APIObject,
	IEnumerator
Visual Basic
Public MustInherit Class ModelCurveArrArrayIterator _
	Inherits APIObject _
	Implements IEnumerator
Visual C++
public ref class ModelCurveArrArrayIterator abstract : public APIObject,
	IEnumerator
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.ModelCurveArrArrayIterator
See Also
ModelCurveArrArrayIterator Members
Autodesk.Revit.DB Namespace